Autodesk.Revit.DB.Electrical.CableTrayType.IsValidBendMultiplier(System.Double)
Identifies if the input bend multiplier is valid.
bendMultiplier:
The bend multiplier to check.
Returns:
True if the value is acceptable, false otherwise.

Autodesk.Revit.DB.Electrical.CableTrayType.IsWithFitting
Whether this cable tray type is with fitting
Remarks:
True if this cable tray type is with fitting type.

Autodesk.Revit.DB.Electrical.CableTrayType.ShapeType
Shape of this cable tray type.

Autodesk.Revit.DB.Electrical.CableTrayType.BendMultiplier
Bend multiplier.
Remarks:
This should be positive and less than 3000.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The bend multiplier value should be positive and less than 3000.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.

Autodesk.Revit.DB.Electrical.CableTrayType
This class represents a cable tray type in Autodesk Revit.